                  IF L-ITEM = R-ITEM
                     CONTINUE
                  ELSE
                     CONTINUE
                  END-IF.
