      ******************************************************************
      *    テストケース：4-1B
      *    プログラム名：日本語化テスト （データ部）JUSTIFIED句
      *    処理概要　　：JUST指定が正しくエラーチェックされるか。
      *  --------------------------------------------------------------
      *   テストケース:５～６
      *   このプログラムは、実行できない。
      ******************************************************************
       IDENTIFICATION        DIVISION.
      ******************************************************************
       PROGRAM-ID.           EX4-1B.
       AUTHOR.               TSH.
       DATE-WRITTEN.         2011-08-18.
       DATE-COMPILED.        2011-08-18.
      ******************************************************************
       ENVIRONMENT           DIVISION.
      ******************************************************************
       CONFIGURATION         SECTION.
       SOURCE-COMPUTER.      PC.
       OBJECT-COMPUTER.      PC.
       SPECIAL-NAMES.
      ******************************************************************
       DATA                  DIVISION.
      ******************************************************************
      ******************************************************************
       WORKING-STORAGE       SECTION.
      ******************************************************************
       01  OMIT-WK            PIC X.
       01  CASE-ID            PIC X(10).
       01  G-01               PIC N(5).
       01  GE-01              PIC N/N/N   JUST.
       01  G-J-01             PIC N(5) JUST.
       01  L-J-10             PIC N(10).
       01  L-J-3              PIC N(3).
       01  L-X-10             PIC X(10).
       01  L-X-3              PIC X(3).
       01  GRP-WK             JUST.
           05  GRP-01         PIC N(10).
           05  GRP-03         PIC N(10).
       
      ******************************************************************
       PROCEDURE             DIVISION.
      ******************************************************************
       MAIN                  SECTION.
       P-010. 
            DISPLAY "TEST START (EX4-1B)".
      *  ケース5.コンパイルエラー（日本語編集＋JUST句）
      *
      *  ケース6.コンパイルエラー（集団項目＋JUST句）
      *  
      *
           display "NG".
            DISPLAY "TEST END   (EX4-1B)".
            *>ACCEPT OMIT-WK.
      *
            GOBACK
            .

